amurzeau/damc_stm32f723disco/src/stm32n6570-dk/FSBL/BSP/stm32n6570_discovery_camera.c
/** @addtogroup STM32N6570-DK
  * @{
  */

/** @addtogroup STM32N6570-DK_CAMERA
  * @{
  */

/** @defgroup STM32N6570-DK_CAMERA_Exported_Variables CAMERA Exported Variables
  * @{
  */
void                *Camera_CompObj = NULL;
DCMIPP_HandleTypeDef hcamera_dcmipp;
CAMERA_Ctx_t         Camera_Ctx[CAMERA_INSTANCES_NBR];
ISP_HandleTypeDef    hcamera_isp;
/**
  * @}
  */

/** @defgroup STM32N6570-DK_CAMERA_Private_Variables CAMERA Private Variables
  * @{
  */
static CAMERA_Drv_t *Camera_Drv = NULL;
static CAMERA_Capabilities_t Camera_Cap;
static int32_t isp_gain;
static int32_t isp_exposure;

/**
  * @}
  */

/** @defgroup STM32N6570-DK_CAMERA_Private_FunctionsPrototypes CAMERA Private Functions Prototypes
  * @{
  */
static void DCMIPP_MspInit(const DCMIPP_HandleTypeDef *hdcmipp);
static void DCMIPP_MspDeInit(const DCMIPP_HandleTypeDef *hdcmipp);

#if (USE_HAL_DCMIPP_REGISTER_CALLBACKS > 0)
static void DCMIPP_PIPE_LineEventCallback(DCMIPP_HandleTypeDef *hdcmipp, uint32_t Pipe);
static void DCMIPP_PIPE_FrameEventCallback(DCMIPP_HandleTypeDef *hdcmipp, uint32_t Pipe);
static void DCMIPP_PIPE_VsyncEventCallback(DCMIPP_HandleTypeDef *hdcmipp, uint32_t Pipe);
static void DCMIPP_PIPE_ErrorCallback(DCMIPP_HandleTypeDef *hdcmipp, uint32_t Pipe);
static void DCMIPP_ErrorCallback(DCMIPP_HandleTypeDef *hdcmipp);
#endif /* (USE_HAL_DCMIPP_REGISTER_CALLBACKS > 0) */

static ISP_StatusTypeDef BSP_GetSensorInfoHelper(uint32_t Instance, ISP_SensorInfoTypeDef *SensorInfo);
static ISP_StatusTypeDef BSP_SetSensorGainHelper(uint32_t Instance, int32_t Gain);
static ISP_StatusTypeDef BSP_GetSensorGainHelper(uint32_t Instance, int32_t *Gain);
static ISP_StatusTypeDef BSP_SetSensorExposureHelper(uint32_t Instance, int32_t Exposure);
static ISP_StatusTypeDef BSP_GetSensorExposureHelper(uint32_t Instance, int32_t *Exposure);

static int32_t IMX335_Probe(uint32_t Resolution, uint32_t PixelFormat);

/**
  * @}
  */

/** @defgroup STM32N6570-DK_CAMERA_Exported_Functions CAMERA Exported Functions
  * @{
  */

/**
  * @brief  Initializes the camera.
  * @param  Instance    Camera instance.
  * @param  Resolution  Camera sensor requested resolution (x, y) : standard resolution
  *         naming QQVGA, QVGA, VGA ...
  * @param  PixelFormat Capture pixel format
  * @retval BSP status
  */
int32_t BSP_CAMERA_Init(uint32_t Instance, uint32_t Resolution, uint32_t PixelFormat)
{
  int32_t ret = BSP_ERROR_NONE;
  ISP_AppliHelpersTypeDef appliHelpers = {0};
  static const ISP_IQParamTypeDef* ISP_IQParamCacheInit[] = {
    &ISP_IQParamCacheInit_IMX335
   };
  if (Instance >= CAMERA_INSTANCES_NBR)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    if ((PixelFormat != CAMERA_PF_RAW_RGGB10) || (Resolution != CAMERA_R2592x1944))
    {
      ret = BSP_ERROR_WRONG_PARAM;
    }

    else
    {
      /* Check if another instance was Initialized */
      Camera_Ctx[Instance].Resolution = Resolution;
      Camera_Ctx[Instance].PixelFormat = PixelFormat;

      /* Set DCMIPP instance */
      hcamera_dcmipp.Instance = DCMIPP;

      /* DCMIPP Initialization */
#if (USE_HAL_DCMIPP_REGISTER_CALLBACKS > 0)
      /* Register the DCMIPP MSP Callbacks */
      if (Camera_Ctx[Instance].IsMspCallbacksValid == 0U)
      {
        if (BSP_CAMERA_RegisterDefaultMspCallbacks(Instance) != BSP_ERROR_NONE)
        {
          return BSP_ERROR_MSP_FAILURE;
        }
      }
#else
      /* DCMIPP Initialization */
      DCMIPP_MspInit(&hcamera_dcmipp);
#endif /* USE_HAL_DCMIPP_REGISTER_CALLBACKS */
      if(MX_DCMIPP_ClockConfig(&hcamera_dcmipp) != HAL_OK)
      {
        ret = BSP_ERROR_PERIPH_FAILURE;
      }
      else if (BSP_CAMERA_HwReset(0) != BSP_ERROR_NONE)
      {
        ret = BSP_ERROR_BUS_FAILURE;
      }
      else
      {
        /* No action */
      }

      if(ret == BSP_ERROR_NONE)
      {
        if (MX_DCMIPP_Init(&hcamera_dcmipp) != HAL_OK)
        {
          ret = BSP_ERROR_PERIPH_FAILURE;
        }
        else
        {
          if (IMX335_Probe(Resolution, PixelFormat) != BSP_ERROR_NONE)
          {
            ret = BSP_ERROR_UNKNOWN_COMPONENT;
          }
          else
          {
#if (USE_HAL_DCMIPP_REGISTER_CALLBACKS > 0)
            /* Register DCMIPP LineEvent, FrameEvent and Error callbacks */
            if (HAL_DCMIPP_PIPE_RegisterCallback(&hcamera_dcmipp, HAL_DCMIPP_PIPE_LINE_EVENT_CB_ID, DCMIPP_PIPE_LineEventCallback) != HAL_OK)
            {
              ret = BSP_ERROR_PERIPH_FAILURE;
            }
            else if (HAL_DCMIPP_PIPE_RegisterCallback(&hcamera_dcmipp, HAL_DCMIPP_PIPE_FRAME_EVENT_CB_ID, DCMIPP_PIPE_FrameEventCallback) != HAL_OK)
            {
              ret = BSP_ERROR_PERIPH_FAILURE;
            }
            else if (HAL_DCMIPP_PIPE_RegisterCallback(&hcamera_dcmipp, HAL_DCMIPP_PIPE_VSYNC_EVENT_CB_ID, DCMIPP_PIPE_VsyncEventCallback) != HAL_OK)
            {
              ret = BSP_ERROR_PERIPH_FAILURE;
            }
            else if (HAL_DCMIPP_PIPE_RegisterCallback(&hcamera_dcmipp, HAL_DCMIPP_PIPE_ERROR_CB_ID, DCMIPP_PIPE_ErrorCallback) != HAL_OK)
            {
              ret = BSP_ERROR_PERIPH_FAILURE;
            }
            else if (HAL_DCMIPP_RegisterCallback(&hcamera_dcmipp, HAL_DCMIPP_ERROR_CB_ID, DCMIPP_ErrorCallback) != HAL_OK)
            {
              ret = BSP_ERROR_PERIPH_FAILURE;
            }
            else
            {
#endif /* (USE_HAL_DCMIPP_REGISTER_CALLBACKS > 0) */
              /* Fill init struct with Camera driver helpers */
              appliHelpers.GetSensorInfo = BSP_GetSensorInfoHelper;
              appliHelpers.SetSensorGain = BSP_SetSensorGainHelper;
              appliHelpers.GetSensorGain = BSP_GetSensorGainHelper;
              appliHelpers.SetSensorExposure = BSP_SetSensorExposureHelper;
              appliHelpers.GetSensorExposure = BSP_GetSensorExposureHelper;

              /* Initialize the Image Signal Processing middleware */
              if(ISP_Init(&hcamera_isp, &hcamera_dcmipp, 0, &appliHelpers, ISP_IQParamCacheInit[0]) != ISP_OK)
              {
                ret = BSP_ERROR_PERIPH_FAILURE;
              }
              else
              {
                ret = BSP_ERROR_NONE;
              }
#if (USE_HAL_DCMIPP_REGISTER_CALLBACKS > 0)
            }
#endif /* (USE_HAL_DCMIPP_REGISTER_CALLBACKS > 0) */
          }
        }
      }
    }
  }

  /* BSP status */
  return ret;
}

/**
  * @brief  DeInitializes the camera.
  * @param  Instance Camera instance.
  * @retval BSP status
  */
int32_t BSP_CAMERA_DeInit(uint32_t Instance)
{
  int32_t ret;

  if (Instance >= CAMERA_INSTANCES_NBR)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {

    hcamera_dcmipp.Instance = DCMIPP;

